MikroElektronika/core_packages/PIC/XC8/def/PIC18F85K90/mcu.h
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0xF71);
// bitfield macros
#define _LCDDATA11_S40C1_POSN                               0x0
#define _LCDDATA11_S40C1_POSITION                           0x0
#define _LCDDATA11_S40C1_SIZE                               0x1
#define _LCDDATA11_S40C1_LENGTH                             0x1
#define _LCDDATA11_S40C1_MASK                               0x1
#define _LCDDATA11_S41C1_POSN                               0x1
#define _LCDDATA11_S41C1_POSITION                           0x1
#define _LCDDATA11_S41C1_SIZE                               0x1
#define _LCDDATA11_S41C1_LENGTH                             0x1
#define _LCDDATA11_S41C1_MASK                               0x2
#define _LCDDATA11_S42C1_POSN                               0x2
#define _LCDDATA11_S42C1_POSITION                           0x2
#define _LCDDATA11_S42C1_SIZE                               0x1
#define _LCDDATA11_S42C1_LENGTH                             0x1
#define _LCDDATA11_S42C1_MASK                               0x4
#define _LCDDATA11_S43C1_POSN                               0x3
#define _LCDDATA11_S43C1_POSITION                           0x3
#define _LCDDATA11_S43C1_SIZE                               0x1
#define _LCDDATA11_S43C1_LENGTH                             0x1
#define _LCDDATA11_S43C1_MASK                               0x8
#define _LCDDATA11_S44C1_POSN                               0x4
#define _LCDDATA11_S44C1_POSITION                           0x4
#define _LCDDATA11_S44C1_SIZE                               0x1
#define _LCDDATA11_S44C1_LENGTH                             0x1
#define _LCDDATA11_S44C1_MASK                               0x10
#define _LCDDATA11_S45C1_POSN                               0x5
#define _LCDDATA11_S45C1_POSITION                           0x5
#define _LCDDATA11_S45C1_SIZE                               0x1
#define _LCDDATA11_S45C1_LENGTH                             0x1
#define _LCDDATA11_S45C1_MASK                               0x20
#define _LCDDATA11_S46C1_POSN                               0x6
#define _LCDDATA11_S46C1_POSITION                           0x6
#define _LCDDATA11_S46C1_SIZE                               0x1
#define _LCDDATA11_S46C1_LENGTH                             0x1
#define _LCDDATA11_S46C1_MASK                               0x40
#define _LCDDATA11_S47C1_POSN                               0x7
#define _LCDDATA11_S47C1_POSITION                           0x7
#define _LCDDATA11_S47C1_SIZE                               0x1
#define _LCDDATA11_S47C1_LENGTH                             0x1
#define _LCDDATA11_S47C1_MASK                               0x80
#define _LCDDATA11_ADMSK1_POSN                              0x1
#define _LCDDATA11_ADMSK1_POSITION                          0x1
#define _LCDDATA11_ADMSK1_SIZE                              0x1
#define _LCDDATA11_ADMSK1_LENGTH                            0x1
#define _LCDDATA11_ADMSK1_MASK                              0x2
#define _LCDDATA11_ADMSK2_POSN                              0x2
#define _LCDDATA11_ADMSK2_POSITION                          0x2
#define _LCDDATA11_ADMSK2_SIZE                              0x1
#define _LCDDATA11_ADMSK2_LENGTH                            0x1
#define _LCDDATA11_ADMSK2_MASK                              0x4
#define _LCDDATA11_ADMSK3_POSN                              0x3
#define _LCDDATA11_ADMSK3_POSITION                          0x3
#define _LCDDATA11_ADMSK3_SIZE                              0x1
#define _LCDDATA11_ADMSK3_LENGTH                            0x1
#define _LCDDATA11_ADMSK3_MASK                              0x8
#define _LCDDATA11_ADMSK4_POSN                              0x4
#define _LCDDATA11_ADMSK4_POSITION                          0x4
#define _LCDDATA11_ADMSK4_SIZE                              0x1
#define _LCDDATA11_ADMSK4_LENGTH                            0x1
#define _LCDDATA11_ADMSK4_MASK                              0x10
#define _LCDDATA11_ADMSK5_POSN                              0x5
#define _LCDDATA11_ADMSK5_POSITION                          0x5
#define _LCDDATA11_ADMSK5_SIZE                              0x1
#define _LCDDATA11_ADMSK5_LENGTH                            0x1
#define _LCDDATA11_ADMSK5_MASK                              0x20

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0xF72);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C2                  :1;
        unsigned S01C2                  :1;
        unsigned S02C2                  :1;
        unsigned S03C2                  :1;
        unsigned S04C2                  :1;
        unsigned S05C2                  :1;
        unsigned S06C2                  :1;
        unsigned S07C2                  :1;
    };
    struct {
        unsigned SSPM012                :1;
        unsigned SSPM112                :1;
        unsigned SSPM212                :1;
        unsigned SSPM312                :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0xF72);
// bitfield macros
#define _LCDDATA12_S00C2_POSN                               0x0
#define _LCDDATA12_S00C2_POSITION                           0x0
#define _LCDDATA12_S00C2_SIZE                               0x1
#define _LCDDATA12_S00C2_LENGTH                             0x1
#define _LCDDATA12_S00C2_MASK                               0x1
#define _LCDDATA12_S01C2_POSN                               0x1
#define _LCDDATA12_S01C2_POSITION                           0x1
#define _LCDDATA12_S01C2_SIZE                               0x1
#define _LCDDATA12_S01C2_LENGTH                             0x1
#define _LCDDATA12_S01C2_MASK                               0x2
#define _LCDDATA12_S02C2_POSN                               0x2
#define _LCDDATA12_S02C2_POSITION                           0x2
#define _LCDDATA12_S02C2_SIZE                               0x1
#define _LCDDATA12_S02C2_LENGTH                             0x1
#define _LCDDATA12_S02C2_MASK                               0x4
#define _LCDDATA12_S03C2_POSN                               0x3
#define _LCDDATA12_S03C2_POSITION                           0x3
#define _LCDDATA12_S03C2_SIZE                               0x1
#define _LCDDATA12_S03C2_LENGTH                             0x1
#define _LCDDATA12_S03C2_MASK                               0x8
#define _LCDDATA12_S04C2_POSN                               0x4
#define _LCDDATA12_S04C2_POSITION                           0x4
#define _LCDDATA12_S04C2_SIZE                               0x1
#define _LCDDATA12_S04C2_LENGTH                             0x1
#define _LCDDATA12_S04C2_MASK                               0x10
#define _LCDDATA12_S05C2_POSN                               0x5
#define _LCDDATA12_S05C2_POSITION                           0x5
#define _LCDDATA12_S05C2_SIZE                               0x1
#define _LCDDATA12_S05C2_LENGTH                             0x1
#define _LCDDATA12_S05C2_MASK                               0x20
#define _LCDDATA12_S06C2_POSN                               0x6
#define _LCDDATA12_S06C2_POSITION                           0x6
#define _LCDDATA12_S06C2_SIZE                               0x1
#define _LCDDATA12_S06C2_LENGTH                             0x1
#define _LCDDATA12_S06C2_MASK                               0x40
#define _LCDDATA12_S07C2_POSN                               0x7
#define _LCDDATA12_S07C2_POSITION                           0x7
#define _LCDDATA12_S07C2_SIZE                               0x1
#define _LCDDATA12_S07C2_LENGTH                             0x1
#define _LCDDATA12_S07C2_MASK                               0x80
#define _LCDDATA12_SSPM012_POSN                             0x0
#define _LCDDATA12_SSPM012_POSITION                         0x0
#define _LCDDATA12_SSPM012_SIZE                             0x1
#define _LCDDATA12_SSPM012_LENGTH                           0x1
#define _LCDDATA12_SSPM012_MASK                             0x1
#define _LCDDATA12_SSPM112_POSN                             0x1
#define _LCDDATA12_SSPM112_POSITION                         0x1
#define _LCDDATA12_SSPM112_SIZE                             0x1
#define _LCDDATA12_SSPM112_LENGTH                           0x1
#define _LCDDATA12_SSPM112_MASK                             0x2
#define _LCDDATA12_SSPM212_POSN                             0x2
#define _LCDDATA12_SSPM212_POSITION                         0x2
#define _LCDDATA12_SSPM212_SIZE                             0x1
#define _LCDDATA12_SSPM212_LENGTH                           0x1
#define _LCDDATA12_SSPM212_MASK                             0x4
#define _LCDDATA12_SSPM312_POSN                             0x3
#define _LCDDATA12_SSPM312_POSITION                         0x3
#define _LCDDATA12_SSPM312_SIZE                             0x1
#define _LCDDATA12_SSPM312_LENGTH                           0x1
#define _LCDDATA12_SSPM312_MASK                             0x8

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0xF73);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C2                  :1;
        unsigned S09C2                  :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned S12C2                  :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0xF73);
// bitfield macros
#define _LCDDATA13_S08C2_POSN                               0x0
#define _LCDDATA13_S08C2_POSITION                           0x0
#define _LCDDATA13_S08C2_SIZE                               0x1
#define _LCDDATA13_S08C2_LENGTH                             0x1
#define _LCDDATA13_S08C2_MASK                               0x1
#define _LCDDATA13_S09C2_POSN                               0x1
#define _LCDDATA13_S09C2_POSITION                           0x1
#define _LCDDATA13_S09C2_SIZE                               0x1
#define _LCDDATA13_S09C2_LENGTH                             0x1
#define _LCDDATA13_S09C2_MASK                               0x2
#define _LCDDATA13_S10C2_POSN                               0x2
#define _LCDDATA13_S10C2_POSITION                           0x2
#define _LCDDATA13_S10C2_SIZE                               0x1
#define _LCDDATA13_S10C2_LENGTH                             0x1
#define _LCDDATA13_S10C2_MASK                               0x4
#define _LCDDATA13_S11C2_POSN                               0x3
#define _LCDDATA13_S11C2_POSITION                           0x3
#define _LCDDATA13_S11C2_SIZE                               0x1
#define _LCDDATA13_S11C2_LENGTH                             0x1
#define _LCDDATA13_S11C2_MASK                               0x8
#define _LCDDATA13_S12C2_POSN                               0x4
#define _LCDDATA13_S12C2_POSITION                           0x4
#define _LCDDATA13_S12C2_SIZE                               0x1
#define _LCDDATA13_S12C2_LENGTH                             0x1
#define _LCDDATA13_S12C2_MASK                               0x10
#define _LCDDATA13_S13C2_POSN                               0x5
#define _LCDDATA13_S13C2_POSITION                           0x5
#define _LCDDATA13_S13C2_SIZE                               0x1
#define _LCDDATA13_S13C2_LENGTH                             0x1
#define _LCDDATA13_S13C2_MASK                               0x20
#define _LCDDATA13_S14C2_POSN                               0x6
#define _LCDDATA13_S14C2_POSITION                           0x6
#define _LCDDATA13_S14C2_SIZE                               0x1
#define _LCDDATA13_S14C2_LENGTH                             0x1
#define _LCDDATA13_S14C2_MASK                               0x40
#define _LCDDATA13_S15C2_POSN                               0x7
#define _LCDDATA13_S15C2_POSITION                           0x7
#define _LCDDATA13_S15C2_SIZE                               0x1
#define _LCDDATA13_S15C2_LENGTH                             0x1
#define _LCDDATA13_S15C2_MASK                               0x80

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0xF74);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C2                  :1;
        unsigned S17C2                  :1;
        unsigned S18C2                  :1;
        unsigned S19C2                  :1;
        unsigned S20C2                  :1;
        unsigned S21C2                  :1;
        unsigned S22C2                  :1;
        unsigned S23C2                  :1;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
} LCDDATA14bits_t;
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0xF74);
// bitfield macros
#define _LCDDATA14_S16C2_POSN                               0x0
#define _LCDDATA14_S16C2_POSITION                           0x0
#define _LCDDATA14_S16C2_SIZE                               0x1
#define _LCDDATA14_S16C2_LENGTH                             0x1
#define _LCDDATA14_S16C2_MASK                               0x1
#define _LCDDATA14_S17C2_POSN                               0x1
#define _LCDDATA14_S17C2_POSITION                           0x1
#define _LCDDATA14_S17C2_SIZE                               0x1
#define _LCDDATA14_S17C2_LENGTH                             0x1
#define _LCDDATA14_S17C2_MASK                               0x2
#define _LCDDATA14_S18C2_POSN                               0x2
#define _LCDDATA14_S18C2_POSITION                           0x2
#define _LCDDATA14_S18C2_SIZE                               0x1
#define _LCDDATA14_S18C2_LENGTH                             0x1
#define _LCDDATA14_S18C2_MASK                               0x4
#define _LCDDATA14_S19C2_POSN                               0x3
#define _LCDDATA14_S19C2_POSITION                           0x3
#define _LCDDATA14_S19C2_SIZE                               0x1
#define _LCDDATA14_S19C2_LENGTH                             0x1
#define _LCDDATA14_S19C2_MASK                               0x8
#define _LCDDATA14_S20C2_POSN                               0x4
#define _LCDDATA14_S20C2_POSITION                           0x4
#define _LCDDATA14_S20C2_SIZE                               0x1
#define _LCDDATA14_S20C2_LENGTH                             0x1
#define _LCDDATA14_S20C2_MASK                               0x10
#define _LCDDATA14_S21C2_POSN                               0x5
#define _LCDDATA14_S21C2_POSITION                           0x5
#define _LCDDATA14_S21C2_SIZE                               0x1
#define _LCDDATA14_S21C2_LENGTH                             0x1
#define _LCDDATA14_S21C2_MASK                               0x20
#define _LCDDATA14_S22C2_POSN                               0x6
#define _LCDDATA14_S22C2_POSITION                           0x6
#define _LCDDATA14_S22C2_SIZE                               0x1
#define _LCDDATA14_S22C2_LENGTH                             0x1
#define _LCDDATA14_S22C2_MASK                               0x40
#define _LCDDATA14_S23C2_POSN                               0x7
#define _LCDDATA14_S23C2_POSITION                           0x7
#define _LCDDATA14_S23C2_SIZE                               0x1
#define _LCDDATA14_S23C2_LENGTH                             0x1
#define _LCDDATA14_S23C2_MASK                               0x80
#define _LCDDATA14_MSK0_POSN                                0x0
#define _LCDDATA14_MSK0_POSITION                            0x0
#define _LCDDATA14_MSK0_SIZE                                0x1
#define _LCDDATA14_MSK0_LENGTH                              0x1
#define _LCDDATA14_MSK0_MASK                                0x1
#define _LCDDATA14_MSK1_POSN                                0x1
#define _LCDDATA14_MSK1_POSITION                            0x1
#define _LCDDATA14_MSK1_SIZE                                0x1
#define _LCDDATA14_MSK1_LENGTH                              0x1
#define _LCDDATA14_MSK1_MASK                                0x2
#define _LCDDATA14_MSK2_POSN                                0x2
#define _LCDDATA14_MSK2_POSITION                            0x2
#define _LCDDATA14_MSK2_SIZE                                0x1
#define _LCDDATA14_MSK2_LENGTH                              0x1
#define _LCDDATA14_MSK2_MASK                                0x4
#define _LCDDATA14_MSK3_POSN                                0x3
#define _LCDDATA14_MSK3_POSITION                            0x3
#define _LCDDATA14_MSK3_SIZE                                0x1
#define _LCDDATA14_MSK3_LENGTH                              0x1
#define _LCDDATA14_MSK3_MASK                                0x8
#define _LCDDATA14_MSK4_POSN                                0x4
#define _LCDDATA14_MSK4_POSITION                            0x4
#define _LCDDATA14_MSK4_SIZE                                0x1
#define _LCDDATA14_MSK4_LENGTH                              0x1
#define _LCDDATA14_MSK4_MASK                                0x10
#define _LCDDATA14_MSK5_POSN                                0x5
#define _LCDDATA14_MSK5_POSITION                            0x5
#define _LCDDATA14_MSK5_SIZE                                0x1
#define _LCDDATA14_MSK5_LENGTH                              0x1
#define _LCDDATA14_MSK5_MASK                                0x20
#define _LCDDATA14_MSK6_POSN                                0x6
#define _LCDDATA14_MSK6_POSITION                            0x6
#define _LCDDATA14_MSK6_SIZE                                0x1
#define _LCDDATA14_MSK6_LENGTH                              0x1
#define _LCDDATA14_MSK6_MASK                                0x40
#define _LCDDATA14_MSK7_POSN                                0x7
#define _LCDDATA14_MSK7_POSITION                            0x7
#define _LCDDATA14_MSK7_SIZE                                0x1
#define _LCDDATA14_MSK7_LENGTH                              0x1
#define _LCDDATA14_MSK7_MASK                                0x80

