MikroElektronika/core_packages/PIC/XC8/def/PIC18F85K90/mcu.h
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
extern volatile unsigned char           LCDDATA22           __at(0xF7C);
#ifndef _LIB_BUILD
asm("LCDDATA22 equ 0F7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C3                  :1;
        unsigned S33C3                  :1;
        unsigned S34C3                  :1;
        unsigned S35C3                  :1;
        unsigned S36C3                  :1;
        unsigned S37C3                  :1;
        unsigned S38C3                  :1;
        unsigned S39C3                  :1;
    };
} LCDDATA22bits_t;
extern volatile LCDDATA22bits_t LCDDATA22bits __at(0xF7C);
// bitfield macros
#define _LCDDATA22_S32C3_POSN                               0x0
#define _LCDDATA22_S32C3_POSITION                           0x0
#define _LCDDATA22_S32C3_SIZE                               0x1
#define _LCDDATA22_S32C3_LENGTH                             0x1
#define _LCDDATA22_S32C3_MASK                               0x1
#define _LCDDATA22_S33C3_POSN                               0x1
#define _LCDDATA22_S33C3_POSITION                           0x1
#define _LCDDATA22_S33C3_SIZE                               0x1
#define _LCDDATA22_S33C3_LENGTH                             0x1
#define _LCDDATA22_S33C3_MASK                               0x2
#define _LCDDATA22_S34C3_POSN                               0x2
#define _LCDDATA22_S34C3_POSITION                           0x2
#define _LCDDATA22_S34C3_SIZE                               0x1
#define _LCDDATA22_S34C3_LENGTH                             0x1
#define _LCDDATA22_S34C3_MASK                               0x4
#define _LCDDATA22_S35C3_POSN                               0x3
#define _LCDDATA22_S35C3_POSITION                           0x3
#define _LCDDATA22_S35C3_SIZE                               0x1
#define _LCDDATA22_S35C3_LENGTH                             0x1
#define _LCDDATA22_S35C3_MASK                               0x8
#define _LCDDATA22_S36C3_POSN                               0x4
#define _LCDDATA22_S36C3_POSITION                           0x4
#define _LCDDATA22_S36C3_SIZE                               0x1
#define _LCDDATA22_S36C3_LENGTH                             0x1
#define _LCDDATA22_S36C3_MASK                               0x10
#define _LCDDATA22_S37C3_POSN                               0x5
#define _LCDDATA22_S37C3_POSITION                           0x5
#define _LCDDATA22_S37C3_SIZE                               0x1
#define _LCDDATA22_S37C3_LENGTH                             0x1
#define _LCDDATA22_S37C3_MASK                               0x20
#define _LCDDATA22_S38C3_POSN                               0x6
#define _LCDDATA22_S38C3_POSITION                           0x6
#define _LCDDATA22_S38C3_SIZE                               0x1
#define _LCDDATA22_S38C3_LENGTH                             0x1
#define _LCDDATA22_S38C3_MASK                               0x40
#define _LCDDATA22_S39C3_POSN                               0x7
#define _LCDDATA22_S39C3_POSITION                           0x7
#define _LCDDATA22_S39C3_SIZE                               0x1
#define _LCDDATA22_S39C3_LENGTH                             0x1
#define _LCDDATA22_S39C3_MASK                               0x80

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
extern volatile unsigned char           LCDDATA23           __at(0xF7D);
#ifndef _LIB_BUILD
asm("LCDDATA23 equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C3                  :1;
        unsigned S41C3                  :1;
        unsigned S42C3                  :1;
        unsigned S43C3                  :1;
        unsigned S44C3                  :1;
        unsigned S45C3                  :1;
        unsigned S46C3                  :1;
        unsigned S47C3                  :1;
    };
} LCDDATA23bits_t;
extern volatile LCDDATA23bits_t LCDDATA23bits __at(0xF7D);
// bitfield macros
#define _LCDDATA23_S40C3_POSN                               0x0
#define _LCDDATA23_S40C3_POSITION                           0x0
#define _LCDDATA23_S40C3_SIZE                               0x1
#define _LCDDATA23_S40C3_LENGTH                             0x1
#define _LCDDATA23_S40C3_MASK                               0x1
#define _LCDDATA23_S41C3_POSN                               0x1
#define _LCDDATA23_S41C3_POSITION                           0x1
#define _LCDDATA23_S41C3_SIZE                               0x1
#define _LCDDATA23_S41C3_LENGTH                             0x1
#define _LCDDATA23_S41C3_MASK                               0x2
#define _LCDDATA23_S42C3_POSN                               0x2
#define _LCDDATA23_S42C3_POSITION                           0x2
#define _LCDDATA23_S42C3_SIZE                               0x1
#define _LCDDATA23_S42C3_LENGTH                             0x1
#define _LCDDATA23_S42C3_MASK                               0x4
#define _LCDDATA23_S43C3_POSN                               0x3
#define _LCDDATA23_S43C3_POSITION                           0x3
#define _LCDDATA23_S43C3_SIZE                               0x1
#define _LCDDATA23_S43C3_LENGTH                             0x1
#define _LCDDATA23_S43C3_MASK                               0x8
#define _LCDDATA23_S44C3_POSN                               0x4
#define _LCDDATA23_S44C3_POSITION                           0x4
#define _LCDDATA23_S44C3_SIZE                               0x1
#define _LCDDATA23_S44C3_LENGTH                             0x1
#define _LCDDATA23_S44C3_MASK                               0x10
#define _LCDDATA23_S45C3_POSN                               0x5
#define _LCDDATA23_S45C3_POSITION                           0x5
#define _LCDDATA23_S45C3_SIZE                               0x1
#define _LCDDATA23_S45C3_LENGTH                             0x1
#define _LCDDATA23_S45C3_MASK                               0x20
#define _LCDDATA23_S46C3_POSN                               0x6
#define _LCDDATA23_S46C3_POSITION                           0x6
#define _LCDDATA23_S46C3_SIZE                               0x1
#define _LCDDATA23_S46C3_LENGTH                             0x1
#define _LCDDATA23_S46C3_MASK                               0x40
#define _LCDDATA23_S47C3_POSN                               0x7
#define _LCDDATA23_S47C3_POSITION                           0x7
#define _LCDDATA23_S47C3_SIZE                               0x1
#define _LCDDATA23_S47C3_LENGTH                             0x1
#define _LCDDATA23_S47C3_MASK                               0x80

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0xF7E);
#ifndef _LIB_BUILD
asm("EECON2 equ 0F7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EECON2                 :8;
    };
} EECON2bits_t;
