MikroElektronika/core_packages/PIC/XC8/def/PIC18F85K90/mcu.h
// LCDDATA15<S26C2>
extern volatile __bit                   S26C2               __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<S26C3>
extern volatile __bit                   S26C3               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<S27C1>
extern volatile __bit                   S27C1               __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<S27C2>
extern volatile __bit                   S27C2               __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<S27C3>
extern volatile __bit                   S27C3               __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<S28C1>
extern volatile __bit                   S28C1               __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<S28C2>
extern volatile __bit                   S28C2               __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<S28C3>
extern volatile __bit                   S28C3               __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<S29C1>
extern volatile __bit                   S29C1               __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<S29C2>
extern volatile __bit                   S29C2               __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<S29C3>
extern volatile __bit                   S29C3               __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<S30C1>
extern volatile __bit                   S30C1               __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<S30C2>
extern volatile __bit                   S30C2               __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<S31C1>
extern volatile __bit                   S31C1               __at(0x7B7F);	// @ (0xF6F * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<S31C2>
extern volatile __bit                   S31C2               __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<S32C1>
extern volatile __bit                   S32C1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<S32C2>
extern volatile __bit                   S32C2               __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<S33C1>
extern volatile __bit                   S33C1               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<S33C2>
extern volatile __bit                   S33C2               __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<S34C1>
extern volatile __bit                   S34C1               __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<S34C2>
extern volatile __bit                   S34C2               __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<S35C1>
extern volatile __bit                   S35C1               __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<S35C2>
extern volatile __bit                   S35C2               __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<S35C3>
extern volatile __bit                   S35C3               __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<S36C1>
extern volatile __bit                   S36C1               __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<S36C2>
extern volatile __bit                   S36C2               __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<S36C3>
extern volatile __bit                   S36C3               __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<S37C1>
extern volatile __bit                   S37C1               __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<S37C2>
extern volatile __bit                   S37C2               __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<S37C3>
extern volatile __bit                   S37C3               __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<S38C1>
extern volatile __bit                   S38C1               __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<S38C2>
extern volatile __bit                   S38C2               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<S38C3>
extern volatile __bit                   S38C3               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<S39C1>
extern volatile __bit                   S39C1               __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<S39C2>
extern volatile __bit                   S39C2               __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<S39C3>
extern volatile __bit                   S39C3               __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<S40C1>
extern volatile __bit                   S40C1               __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA5<S40C15>
extern volatile __bit                   S40C15              __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 S40C15_bit          _BIT_ACCESS(LCDDATA5,0)
// LCDDATA17<S40C2>
extern volatile __bit                   S40C2               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0x7BE8);	// @ (0xF7D * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<S41C1>
extern volatile __bit                   S41C1               __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<S41C2>
extern volatile __bit                   S41C2               __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0x7BE9);	// @ (0xF7D * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<S42C1>
extern volatile __bit                   S42C1               __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<S42C2>
extern volatile __bit                   S42C2               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<S42C3>
extern volatile __bit                   S42C3               __at(0x7BEA);	// @ (0xF7D * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<S43C1>
extern volatile __bit                   S43C1               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<S43C2>
extern volatile __bit                   S43C2               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<S43C3>
extern volatile __bit                   S43C3               __at(0x7BEB);	// @ (0xF7D * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0x7BEC);	// @ (0xF7D * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<S45C1>
extern volatile __bit                   S45C1               __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<S45C2>
extern volatile __bit                   S45C2               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<S45C3>
extern volatile __bit                   S45C3               __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<S46C1>
extern volatile __bit                   S46C1               __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<S46C2>
extern volatile __bit                   S46C2               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<S46C3>
extern volatile __bit                   S46C3               __at(0x7BEE);	// @ (0xF7D * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<S47C1>
extern volatile __bit                   S47C1               __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<S47C2>
extern volatile __bit                   S47C2               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<S47C3>
extern volatile __bit                   S47C3               __at(0x7BEF);	// @ (0xF7D * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA23,7)
// RCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x7E86);	// @ (0xFD0 * 8 + 6)
#define                                 SBOREN_bit          _BIT_ACCESS(RCON,6)
// PORTC<SCK1>
extern volatile __bit                   SCK1                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK1_bit            _BIT_ACCESS(PORTC,3)
// PORTD<SCK2>
extern volatile __bit                   SCK2                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SCK2_bit            _BIT_ACCESS(PORTD,6)
// PORTC<SCKLI>
extern volatile __bit                   SCKLI               __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 SCKLI_bit           _BIT_ACCESS(PORTC,0)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// PORTC<SCL1>
extern volatile __bit                   SCL1                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL1_bit            _BIT_ACCESS(PORTC,3)
// PORTD<SCL2>
extern volatile __bit                   SCL2                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SCL2_bit            _BIT_ACCESS(PORTD,6)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDA1>
extern volatile __bit                   SDA1                __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA1_bit            _BIT_ACCESS(PORTC,4)
// PORTD<SDA2>
extern volatile __bit                   SDA2                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 SDA2_bit            _BIT_ACCESS(PORTD,5)
// PORTC<SDI1>
extern volatile __bit                   SDI1                __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI1_bit            _BIT_ACCESS(PORTC,4)
// PORTD<SDI2>
extern volatile __bit                   SDI2                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 SDI2_bit            _BIT_ACCESS(PORTD,5)
// PORTC<SDO1>
extern volatile __bit                   SDO1                __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO1_bit            _BIT_ACCESS(PORTC,5)
// PORTD<SDO2>
extern volatile __bit                   SDO2                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 SDO2_bit            _BIT_ACCESS(PORTD,4)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0x77B0);	// @ (0xEF6 * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0x77B1);	// @ (0xEF6 * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0x77B2);	// @ (0xEF6 * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0x77B3);	// @ (0xEF6 * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0x77B4);	// @ (0xEF6 * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0x77B5);	// @ (0xEF6 * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0x77B6);	// @ (0xEF6 * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0x77B7);	// @ (0xEF6 * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0x77B8);	// @ (0xEF7 * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
extern volatile __bit                   SE09                __at(0x77B9);	// @ (0xEF7 * 8 + 1)
#define                                 SE09_bit            _BIT_ACCESS(LCDSE1,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x77BA);	// @ (0xEF7 * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x77BB);	// @ (0xEF7 * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x77BC);	// @ (0xEF7 * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x77BD);	// @ (0xEF7 * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x77BE);	// @ (0xEF7 * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x77BF);	// @ (0xEF7 * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x77C0);	// @ (0xEF8 * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
